---
kind: type
id: T:Autodesk.Revit.DB.DimensionEqualityLabelFormatting
source: html/019b51cc-346a-5861-f093-669a7446c874.htm
---
# Autodesk.Revit.DB.DimensionEqualityLabelFormatting

Instances of this class represent individual parameters used to make up a dimension equality formula for continuous linear or angular dimensions.

## Syntax (C#)
```csharp
public class DimensionEqualityLabelFormatting : IDisposable
```